// pages/component/funExplain/funExplain.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {
    isHidden:{type:Boolean,value:true},
    funKey:String, 
    type:{type:Number,value:0} // 1=发布介绍 0=功能说明
  },

  /**
   * 组件的初始数据
   */
  data: {
    descs:[
      {key:"002007",value:"支持二代身份证人像面所有字段的识别，包括姓名、性别、民族、出生日期、住址、公民身份证号、包括签发机关、有效期限"},
      {key:"002013",value:"支持中国大陆护照、中国香港护照、泰国护照及其他国外护照个人资料页多个字段的检测与识别"},
      {key:"002017",value:"支持居民户口簿户主页及成员页关键字段的识别，包括姓名、户别、地址、籍贯、身份证号码等"},
      {key:"002006",value:"支持港澳台居住证的正面及反面的关键字段识别，包含姓名、性别、出生、地址、身份证号、通行证号码、签发机关、有效期限、签发次数"},
      {key:"002009",value:"支持港澳居民来往内地通行证及台湾居民来往大陆通行证识别，包含中英文姓名、出生日期、性别、有效期限、签发机关、证件号码、换证次数、证件类型"},
      {key:"002014",value:"支持对卡式港澳台通行证的识别，包括签发地点、签发机关、有效期限、性别、出生日期、英文姓名、姓名、证件号等字段"},
      {key:"002001",value:"支持对中国大陆主流银行卡的卡号、银行信息、有效期等关键字段的检测与识别"},
      {key:"002005",value:"支持不动产权证关键字段的识别，包括使用期限、面积、用途、权利性质、权利类型、坐落、共有情况、权利人、权利其他情况等。"},
      {key:"002002",value:"支持快速精准识别营业执照上的字段，包括注册号、公司名称、经营场所、主体类型、法定代表人、注册资金、组成形式、成立日期、营业期限和经营范围等字段"},
      {key:"002004",value:"支持智能化识别各类企业登记证书、许可证书、企业执照、三证合一类证书，结构化输出统一社会信用代码、公司名称、法定代表人、公司地址、注册资金、企业类型、经营范围等关键字段"},
      {key:"001001",value:"支持增值税专用发票、增值税普通发票、增值税电子发票全字段的内容检测和识别，包括发票代码、发票号码、开票日期、合计金额、校验码、税率等"},
      {key:"001018",value:"支持市面上主流版式电子运单的识别，包括收件人和寄件人的姓名、电话、地址以及运单号等字段"},
      {key:"001016",value:"支持火车票全字段的识别，包括编号、票价、姓名、座位号、出发时间、出发站、到达站、车次、席别等"},
      {key:"001014",value:"支持出租车发票关键字段的识别，包括发票号码、发票代码、金额、日期等字段"},
      {key:"001002",value:"支持识别公路汽车客票的发票代码、发票号码、日期、姓名、票价等字段"},
      {key:"001013",value:"支持识别轮船票的发票代码、发票号码、日期、姓名、票价等字段。"},
      {key:"001007",value:"支持机票行程单关键字段的识别，包括姓名、身份证件号码、航班号、票价 、合计、电子客票号码、填开日期等"},
      {key:"001015",value:"支持对过路过桥费发票的发票代码、发票号码、日期、小写金额等关键字段的识别"},
      {key:"001017",value:"支持对增值税发票（卷票）的发票代码、发票号码、日期、校验码、合计金额（小写）等关键字段的识别"},
      {key:"001012",value:"支持定额发票的发票号码、发票代码及金额等关键字段的识别"},
      {key:"001009",value:"支持对通用机打发票的发票代码、发票号码、日期、购买方识别号、销售方识别号、校验码、小写金额等关键字段的识别"},
      {key:"001003",value:"支持机动车销售统一发票和二手车销售统一发票的识别，包括发票号码、发票代码、合计金额、合计税额等二十多个字段"},
      {key:"001004",value:"支持对完税证明的税号、纳税人识别号、纳税人名称、金额合计大写、金额合计小写、填发日期、税务机关、填票人等关键字段的识别"},
      {key:"001011",value:"支持多张、多类型票据的混合识别，目前已支持增值税发票、定额发票、火车票、出租车发票、机票行程单等共11种票据"},
      {key:"001005",value:"支持常见银行票据的自动分类和识别。整单识别包括支票（含现金支票、普通支票、转账支票），承兑汇票（含银行承兑汇票、商业承兑汇票）以及进账单等"},
      {key:"001008",value:"支持病案首页、费用清单、结算单、医疗发票四种理赔单据的文本识别和结构化输出，可用于保险用户申请保险报销时的信息录入和审核校对"},
      {key:"003003",value:"支持行驶证主页所有字段的自动定位与识别，包含号牌号码、车辆类型、所有人、住址、使用性质、品牌型号、车辆识别代码、发动机号码、注册日期、发证日期、印章、号牌号码、档案编号、核定人数、总质量、整备质量、核定载质量、外廓尺寸、备注、核验记录、准牵引总质量"},
      {key:"003001",value:"支持对驾驶证主页所有字段的自动定位与识别，包含证号、姓名、性别、国籍、住址、出生日期、初次领证日期、准驾车型、有效期限等"},
      {key:"003002",value:"支持对中国大陆机动车车牌的自动定位和识别，返回地域编号和车牌号信息"},
      {key:"003005",value:"支持图片内车辆识别代号（VIN）的检测和识别"},
      {key:"003004",value:"支持国内机动车登记证书主要字段的结构化识别，包括机动车所有人、身份证明名称、号码、车辆型号、车辆识别代号、发动机号、制造厂名称等"},
      {key:"004003",value:"支持多场景、任意版面下整图文字的识别，包括中英文、字母、数字和日语、韩语、西班牙语等十余种多语言识别"},
      {key:"004005",value:"支持图片内手写体文字的检测和识别，针对手写字体无规则、字迹潦草、模糊等特点进行了识别能力的增强"},
      {key:"004001",value:"支持多场景、任意版面下的英文、字母、数字和常见字符的识别，同时覆盖英文印刷体和英文手写体识别"},
      {key:"004006",value:"支持二维码的识别"},
      {key:"004006",value:"支持条形码"},
      {key:"005002",value:"支持作业算式题目的自动识别，目前覆盖 K12 学力范围内的 14 种题型，包括加减乘除四则运算、分数四则运算、竖式四则运算、脱式计算等"},
      {key:"006001",value:"可支持中、英、日、韩等20+语言互译"},
      {key:"100000",value:"新版本亮点: \n 1、增加了算式校对功能，k12的各类算式结果进行校对。\n 2、增加了翻译功能，可支持20多种语言进行互译 \n 3、增加了印刷体文字识别 \n 4、增加了手写体文字的识别"}
    ]
  },
  pageLifetimes: {
    // 组件所在页面的生命周期函数
    show:function(){
      console.log("###########"+this.data.funKey)
      for (const iterator of this.data.descs) {
          if(iterator.key == this.data.funKey){
            this.setData({
              desc:iterator.value
           })
           return
          }
      }

    }
  },
  /**
   * 组件的方法列表
   */
  methods: {

    closeExplain:function(){
      wx.setStorageSync("fun"+this.data.funKey, true)
      this.setData({
        isHidden:true
      })
     }
  }
})
